
const patterns = {
  "Автотройдар": /(^|\W)авто[тт]р[оа]й?дар(\W|$)/i,
  "Автокран": /(^|\W)авто[кх]р[ао]н(\W|$)/i,
  "Бетоновая": /(^|\W)бет[оа]н[оа]вая?(\W|$)/i,
  "Вульфанар": /(^|\W)в[ую]льф[ао]нар(\W|$)/i,
  "Каток": /(^|\W)к[ао]т[оа]к(\W|$)/i,
  "Композитор (ПУАТО)": /(композитор.*п[ую]ато|п[ую]ато.*композитор)/i,
  "Манипулятор": /(^|\W)манипул[яа]тор(\W|$)/i,
  "Механическая": /(^|\W)мех[аи]нич[еи]ская?(\W|$)/i,
  "Мини-экспозитор": /(^|\W)мини[-\s]?э?кспозитор(\W|$)/i,
  "Полномоченное иммунское": /(^|\W)полномоченн?ое иммунск[оа]е(\W|$)/i,
  "Самоход": /(^|\W)самох[оа]д(\W|$)/i,
  "Газер": /(^|\W)г[ао]з[еэ]р(\W|$)/i,
  "Трантор": /(^|\W)тр[ао]нтор(\W|$)/i,
  "Тран": /(^|\W)тр[ао]н(\W|$)/i,
  "Фронтальный погрузчик": /(^|\W)фронтал[ь]?ный погрузч[иі]к(\W|$)/i,
  "Шахмад (администра)": /(ш[ао]хм[ао]д.*администра|администра.*ш[ао]хм[ао]д)/i,
  "Эвакуатор": /(^|\W)э?ваку[ао]тор(\W|$)/i,
  "Экспозитор гусеничный": /(^|\W)э?кспозитор гусеничн[ыа]й(\W|$)/i,
  "Экспозитор колючий": /(^|\W)э?кспозитор колюч[иі]й(\W|$)/i,
  "Экспозитор погрузчик": /(^|\W)э?кспозитор погрузч[иі]к(\W|$)/i,
  "Ямбар": /(^|\W)[яй]мб[ао]р(\W|$)/i,
  "Гамблер": /(^|\W)г[ао]мбл[еэ]р(\W|$)/i,
  "Вилки грунта": /(^|\W)в[иі]лк[иі] грунт[ао](\W|$)/i,
  "Норудика материалы": /(^|\W)норудик[ао] материал[ыі](\W|$)/i,
  "Гайки": /(^|\W)г[ао][ий]к[иі](\W|$)/i,
  "Фура": /(^|\W)ф[ую]р[ао](\W|$)/i,
  "Принц грунта": /(^|\W)прин[цс] грунт[ао](\W|$)/i,
  "Вибрация рукоятки": /(^|\W)вибр[ао]ци[яй] руко[яй]тк[иі](\W|$)/i,
  "Автомашин": /(^|\W)автом[ао]ш[иі]н(\W|$)/i,
  "Наличие": /(^|\W)нал[иі]чи[ея](\W|$)/i,
  "Заказы за пределами": /(^|\W)з[ао]к[ао]зы за предел[ао]ми(\W|$)/i,
  "Индекс": /(^|\W)инд[еэ]к[сз](\W|$)/i,
  "Крышку": /(^|\W)кр[ыі]шк[ую](\W|$)/i,
  "Контриксер": /(^|\W)контри?к[сз][еэ]р(\W|$)/i,
  "Фреза": /(^|\W)фр[еэ]з[ао](\W|$)/i,
  "Бетонная": /(^|\W)бет[оа]нн[ао]я(\W|$)/i,
  "Темперационный погрузчик": /(^|\W)темп[еэ]раци[оа]нн?ый погрузч[иі]к(\W|$)/i,
  "Вилки лигал": /(^|\W)в[иі]лк[иі] лиг[ао]л(\W|$)/i,
  "Декларирован экспозиторы": /(^|\W)декларирован экспозитор[ыі](\W|$)/i
};

export function findMatch(message) {
  // Нормализуем текст: удаляем лишние пробелы и приводим к одному регистру
  const normalizedMsg = message.toLowerCase().replace(/\s+/g, ' ').trim();
  
  for (const [key, regex] of Object.entries(patterns)) {
    if (regex.test(normalizedMsg)) {
      return key;
    }
  } 
  return null;
}
